#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/18d4f0fe-9790-414e-a852-0466fbd486f4/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurecaf_name.appsvc_subnet must be replaced
-/+ resource "azurecaf_name" "appsvc_subnet" {
      ~ id            = "eahfcteguwocrcji" -> (known after apply)
      ~ name          = "appsvc" -> "eslz1" # forces replacement
      + prefixes      = [ # forces replacement
          + "spoke",
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      ~ result        = "snet-appsvc" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurecaf_name.caf_name_id_contributor will be created
  + resource "azurecaf_name" "caf_name_id_contributor" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_user_assigned_identity"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "contributor",
        ]
      + use_slug      = true
    }

  # azurecaf_name.caf_name_id_reader will be created
  + resource "azurecaf_name" "caf_name_id_reader" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_user_assigned_identity"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "reader",
        ]
      + use_slug      = true
    }

  # azurecaf_name.caf_name_law will be created
  + resource "azurecaf_name" "caf_name_law" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # azurecaf_name.caf_name_spoke_rg will be created
  + resource "azurecaf_name" "caf_name_spoke_rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "spoke",
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # azurecaf_name.contributor_identity will be destroyed
  # (because azurecaf_name.contributor_identity is not in configuration)
  - resource "azurecaf_name" "contributor_identity" {
      - clean_input   = true -> null
      - id            = "faaiwooqlrertweh" -> null
      - name          = "spoke-scenario1-contributor" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_user_assigned_identity" -> null
      - result        = "msi-spoke-scenario1-contributor" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.devops_subnet will be destroyed
  # (because azurecaf_name.devops_subnet is not in configuration)
  - resource "azurecaf_name" "devops_subnet" {
      - clean_input   = true -> null
      - id            = "fjomqdwilwaduxok" -> null
      - name          = "devops" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_subnet" -> null
      - result        = "snet-devops" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.devops_vm will be destroyed
  # (because azurecaf_name.devops_vm is not in configuration)
  - resource "azurecaf_name" "devops_vm" {
      - clean_input   = true -> null
      - id            = "ttfcmqugwsdkfhks" -> null
      - name          = "spoke-scenario1-devops" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_windows_virtual_machine" -> null
      - result        = "vm-5461" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "5461",
        ] -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.ingress_subnet will be destroyed
  # (because azurecaf_name.ingress_subnet is not in configuration)
  - resource "azurecaf_name" "ingress_subnet" {
      - clean_input   = true -> null
      - id            = "uovsewjfyvkpqgmc" -> null
      - name          = "ingress" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_subnet" -> null
      - result        = "snet-ingress" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.law must be replaced
-/+ resource "azurecaf_name" "law" {
      ~ id            = "skxvsjgcgfwtcqdj" -> (known after apply)
      ~ name          = "scenario1" -> "eslz1" # forces replacement
      ~ result        = "log-scenario1-prod" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurecaf_name.private_link_subnet will be destroyed
  # (because azurecaf_name.private_link_subnet is not in configuration)
  - resource "azurecaf_name" "private_link_subnet" {
      - clean_input   = true -> null
      - id            = "rxoobxqlkxiyoegd" -> null
      - name          = "private-link" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_subnet" -> null
      - result        = "snet-private-link" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.reader_identity will be destroyed
  # (because azurecaf_name.reader_identity is not in configuration)
  - resource "azurecaf_name" "reader_identity" {
      - clean_input   = true -> null
      - id            = "xrauxtuqfikfeusf" -> null
      - name          = "spoke-scenario1-reader" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_user_assigned_identity" -> null
      - result        = "msi-spoke-scenario1-reader" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.resource_group will be destroyed
  # (because azurecaf_name.resource_group is not in configuration)
  - resource "azurecaf_name" "resource_group" {
      - clean_input   = true -> null
      - id            = "kfnewsrfqcyurtyr" -> null
      - name          = "spoke-scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_resource_group" -> null
      - result        = "rg-spoke-scenario1-prod-wus3" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "prod",
          - "wus3",
        ] -> null
      - use_slug      = true -> null
    }

  # azurecaf_name.spoke_network will be destroyed
  # (because azurecaf_name.spoke_network is not in configuration)
  - resource "azurecaf_name" "spoke_network" {
      - clean_input   = true -> null
      - id            = "lncsogkngwnchrpr" -> null
      - name          = "spoke-scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_virtual_network" -> null
      - result        = "vnet-spoke-scenario1-prod" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "prod",
        ] -> null
      - use_slug      = true -> null
    }

  # azurerm_log_analytics_workspace.law must be replaced
-/+ resource "azurerm_log_analytics_workspace" "law" {
      - cmk_for_query_forced               = false -> null
      ~ id                                 = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.OperationalInsights/workspaces/log-scenario1-prod" -> (known after apply)
      ~ name                               = "log-scenario1-prod" # forces replacement -> (known after apply) # forces replacement
      ~ primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      ~ resource_group_name                = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_shared_key               = (sensitive value)
      ~ tags                               = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
        }
      ~ workspace_id                       = "cd74b5b5-f37f-4600-98ad-40e4ef86be2d" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # azurerm_resource_group.spoke must be replaced
-/+ resource "azurerm_resource_group" "spoke" {
      ~ id       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3" -> (known after apply)
      ~ name     = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ tags     = {
          + "Environment"      = "prod"
          + "Owner"            = "cloudops@contoso.com"
          + "Project"          = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
          + "Terraform"        = "true"
          - "application-name" = "scenario1" -> null
          - "environment"      = "prod" -> null
          - "terraform"        = "true" -> null
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_user_assigned_identity.contributor must be replaced
-/+ resource "azurerm_user_assigned_identity" "contributor" {
      ~ client_id           = "9a1f7faa-9f41-4c41-be7e-087eb726c23f" -> (known after apply)
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.ManagedIdentity/userAssignedIdentities/msi-spoke-scenario1-contributor" -> (known after apply)
      ~ name                = "msi-spoke-scenario1-contributor" # forces replacement -> (known after apply) # forces replacement
      ~ principal_id        = "e0423675-ddf8-4a7d-82f0-74bf3e39617f" -> (known after apply)
      ~ resource_group_name = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      - tags                = {} -> null
      ~ tenant_id           = "449fbe1d-9c99-4509-9014-4fd5cf25b014" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_user_assigned_identity.reader must be replaced
-/+ resource "azurerm_user_assigned_identity" "reader" {
      ~ client_id           = "dc0137c5-9e48-4ec8-b52f-8b37c8ca4110" -> (known after apply)
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.ManagedIdentity/userAssignedIdentities/msi-spoke-scenario1-reader" -> (known after apply)
      ~ name                = "msi-spoke-scenario1-reader" # forces replacement -> (known after apply) # forces replacement
      ~ principal_id        = "59ae8e61-8c55-4668-81c8-029d34ac759f" -> (known after apply)
      ~ resource_group_name = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      - tags                = {} -> null
      ~ tenant_id           = "449fbe1d-9c99-4509-9014-4fd5cf25b014" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_virtual_network_peering.hub_to_spoke will be destroyed
  # (because azurerm_virtual_network_peering.hub_to_spoke is not in configuration)
  - resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      - allow_forwarded_traffic      = false -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3/virtualNetworkPeerings/hub-to-spoke-scenario1" -> null
      - name                         = "hub-to-spoke-scenario1" -> null
      - remote_virtual_network_id    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod" -> null
      - resource_group_name          = "rg-hub-scenario1-wus3" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "vnet-hub-scenario1-wus3" -> null
    }

  # azurerm_virtual_network_peering.spoke_to_hub will be destroyed
  # (because azurerm_virtual_network_peering.spoke_to_hub is not in configuration)
  - resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      - allow_forwarded_traffic      = false -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/virtualNetworkPeerings/spoke-to-hub-scenario1" -> null
      - name                         = "spoke-to-hub-scenario1" -> null
      - remote_virtual_network_id    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3" -> null
      - resource_group_name          = "rg-spoke-scenario1-prod-wus3" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "vnet-spoke-scenario1-prod" -> null
    }

  # random_password.vm_admin_password will be destroyed
  # (because random_password.vm_admin_password is not in configuration)
  - resource "random_password" "vm_admin_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # random_password.vm_admin_username will be destroyed
  # (because random_password.vm_admin_username is not in configuration)
  - resource "random_password" "vm_admin_username" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 10 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.app_configuration[0].azurecaf_name.app_config will be destroyed
  # (because azurecaf_name.app_config is not in configuration)
  - resource "azurecaf_name" "app_config" {
      - clean_input   = true -> null
      - id            = "hvfhgntvkcpjiyhr" -> null
      - name          = "scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_app_configuration" -> null
      - result        = "appcg-scenario1-prod-5461" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "prod",
          - "5461",
        ] -> null
      - use_slug      = true -> null
    }

  # module.app_configuration[0].azurecaf_name.caf_name_appconf will be created
  + resource "azurecaf_name" "caf_name_appconf" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_app_configuration"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "5461",
        ]
      + use_slug      = true
    }

  # module.app_configuration[0].azurecaf_name.private_endpoint must be replaced
-/+ resource "azurecaf_name" "private_endpoint" {
      ~ id            = "pyswsamufmtrushj" -> (known after apply)
      ~ name          = "appcg-scenario1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ result        = "pe-appcg-scenario1-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.app_configuration[0].azurerm_app_configuration.this must be replaced
-/+ resource "azurerm_app_configuration" "this" {
      ~ endpoint                   = "https://appcg-scenario1-prod-5461.azconfig.io" -> (known after apply)
      ~ id                         = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.AppConfiguration/configurationStores/appcg-scenario1-prod-5461" -> (known after apply)
      ~ name                       = "appcg-scenario1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ primary_read_key           = [] -> (known after apply)
      ~ primary_write_key          = [] -> (known after apply)
      ~ resource_group_name        = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_read_key         = [] -> (known after apply)
      ~ secondary_write_key        = [] -> (known after apply)
      ~ tags                       = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          - "environment" = "prod" -> null
          + "module"      = "app-configuration"
        }
        # (6 unchanged attributes hidden)
    }

  # module.app_configuration[0].azurerm_private_dns_a_record.this must be replaced
-/+ resource "azurerm_private_dns_a_record" "this" {
      ~ fqdn                = "appcg-scenario1-prod-5461.privatelink.azconfig.io." -> (known after apply)
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/privateDnsZones/privatelink.azconfig.io/A/appcg-scenario1-prod-5461" -> (known after apply)
      ~ name                = "appcg-scenario1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ records             = [
          - "10.240.11.5",
        ] -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.app_configuration[0].azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [
          - {
              - fqdn         = "appcg-scenario1-prod-5461.azconfig.io"
              - ip_addresses = [
                  - "10.240.11.5",
                ]
            },
        ] -> (known after apply)
      ~ id                       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/privateEndpoints/pe-appcg-scenario1-prod-5461" -> (known after apply)
      ~ name                     = "pe-appcg-scenario1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/networkInterfaces/pe-appcg-scenario1-prod-5461.nic.47c44059-1023-40e2-9918-d69f8a28d16b"
              - name = "pe-appcg-scenario1-prod-5461.nic.47c44059-1023-40e2-9918-d69f8a28d16b"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [] -> (known after apply)
      ~ resource_group_name      = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id                = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-private-link" # forces replacement -> (known after apply) # forces replacement
      - tags                     = {} -> null
        # (1 unchanged attribute hidden)

      ~ private_service_connection {
            name                           = "app-config-private-endpoint"
          ~ private_connection_resource_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.AppConfiguration/configurationStores/appcg-scenario1-prod-5461" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.240.11.5" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.app_configuration[0].azurerm_role_assignment.data_owners[0] must be replaced
-/+ resource "azurerm_role_assignment" "data_owners" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.AppConfiguration/configurationStores/appcg-scenario1-prod-5461/providers/Microsoft.Authorization/roleAssignments/00773630-3305-2441-cffe-c432f199ee9b" -> (known after apply)
      ~ name                             = "00773630-3305-2441-cffe-c432f199ee9b" -> (known after apply)
      ~ principal_id                     = "e0423675-ddf8-4a7d-82f0-74bf3e39617f" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/5ae67dd6-50cb-40e7-96ff-dc2bfa4b606b" -> (known after apply)
      ~ scope                            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.AppConfiguration/configurationStores/appcg-scenario1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.app_configuration[0].azurerm_role_assignment.data_readers[0] must be replaced
-/+ resource "azurerm_role_assignment" "data_readers" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.AppConfiguration/configurationStores/appcg-scenario1-prod-5461/providers/Microsoft.Authorization/roleAssignments/57f38bb6-3905-3e4a-a26c-7f4fd0d28675" -> (known after apply)
      ~ name                             = "57f38bb6-3905-3e4a-a26c-7f4fd0d28675" -> (known after apply)
      ~ principal_id                     = "59ae8e61-8c55-4668-81c8-029d34ac759f" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/516239f1-63e1-4d78-a4de-a74fb236a071" -> (known after apply)
      ~ scope                            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.AppConfiguration/configurationStores/appcg-scenario1-prod-5461" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.app_insights.azurecaf_name.app_insights will be destroyed
  # (because azurecaf_name.app_insights is not in configuration)
  - resource "azurecaf_name" "app_insights" {
      - clean_input   = true -> null
      - id            = "xuhcuoesrdkfiohr" -> null
      - name          = "scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_application_insights" -> null
      - result        = "appi-scenario1-prod" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "prod",
        ] -> null
      - use_slug      = true -> null
    }

  # module.app_insights.azurerm_application_insights.this will be destroyed
  # (because azurerm_application_insights.this is not in configuration)
  - resource "azurerm_application_insights" "this" {
      - app_id                                = "bc788d07-2ce1-4a2b-9c13-8b86bb01292f" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Insights/components/appi-scenario1-prod" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "westus3" -> null
      - name                                  = "appi-scenario1-prod" -> null
      - resource_group_name                   = "rg-spoke-scenario1-prod-wus3" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {} -> null
      - workspace_id                          = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.OperationalInsights/workspaces/log-scenario1-prod" -> null
    }

  # module.app_service.azurecaf_name.caf_name_appinsights will be created
  + resource "azurecaf_name" "caf_name_appinsights" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_application_insights"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.app_service.azurecaf_name.caf_name_asp will be created
  + resource "azurecaf_name" "caf_name_asp" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_app_service_plan"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.app_service.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westus3"
      + name                                  = (known after apply)
      + resource_group_name                   = (known after apply)
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.app_service.azurerm_service_plan.this must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Web/serverfarms/asp-scenario1-win-prod" -> (known after apply)
      ~ kind                         = "app" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "asp-scenario1-win-prod" # forces replacement -> (known after apply) # forces replacement
      ~ reserved                     = false -> (known after apply)
      ~ resource_group_name          = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ tags                         = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "app-service"
        }
        # (6 unchanged attributes hidden)
    }

  # module.front_door.azurecaf_name.frontdoor will be destroyed
  # (because azurecaf_name.frontdoor is not in configuration)
  - resource "azurecaf_name" "frontdoor" {
      - clean_input   = true -> null
      - id            = "gwevwynflcnhtxnx" -> null
      - name          = "scenario1" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_cdn_frontdoor_profile" -> null
      - result        = "cfdp-scenario1-prod" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "prod",
        ] -> null
      - use_slug      = true -> null
    }

  # module.front_door.azurerm_cdn_frontdoor_firewall_policy.waf[0] will be destroyed
  # (because azurerm_cdn_frontdoor_firewall_policy.waf is not in configuration)
  - resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [] -> null
      - id                                = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/wafpolicymicrosoftdefaultruleset21" -> null
      - mode                              = "Prevention" -> null
      - name                              = "wafpolicymicrosoftdefaultruleset21" -> null
      - resource_group_name               = "rg-spoke-scenario1-prod-wus3" -> null
      - sku_name                          = "Premium_AzureFrontDoor" -> null
      - tags                              = {} -> null

      - managed_rule {
          - action  = "Block" -> null
          - type    = "Microsoft_DefaultRuleSet" -> null
          - version = "2.1" -> null
        }
    }

  # module.front_door.azurerm_cdn_frontdoor_profile.frontdoor will be destroyed
  # (because azurerm_cdn_frontdoor_profile.frontdoor is not in configuration)
  - resource "azurerm_cdn_frontdoor_profile" "frontdoor" {
      - id                       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Cdn/profiles/cfdp-scenario1-prod" -> null
      - name                     = "cfdp-scenario1-prod" -> null
      - resource_group_name      = "rg-spoke-scenario1-prod-wus3" -> null
      - resource_guid            = "9d932c88-5f8a-4c57-ad23-3edf5506c660" -> null
      - response_timeout_seconds = 120 -> null
      - sku_name                 = "Premium_AzureFrontDoor" -> null
      - tags                     = {} -> null
    }

  # module.front_door.azurerm_cdn_frontdoor_security_policy.web_app_waf[0] will be destroyed
  # (because azurerm_cdn_frontdoor_security_policy.web_app_waf is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "web_app_waf" {
      - cdn_frontdoor_profile_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Cdn/profiles/cfdp-scenario1-prod" -> null
      - id                       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Cdn/profiles/cfdp-scenario1-prod/securityPolicies/WAF-Security-Policy" -> null
      - name                     = "WAF-Security-Policy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/wafpolicymicrosoftdefaultruleset21" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Cdn/profiles/cfdp-scenario1-prod/afdEndpoints/scenario1-prod-5461" -> null
                    }
                }
            }
        }
    }

  # module.front_door.azurerm_monitor_diagnostic_setting.this[0] will be destroyed
  # (because azurerm_monitor_diagnostic_setting.this is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "this" {
      - id                         = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Cdn/profiles/cfdp-scenario1-prod|cfdp-scenario1-prod-diagnostic-settings}" -> null
      - log_analytics_workspace_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.OperationalInsights/workspaces/log-scenario1-prod" -> null
      - name                       = "cfdp-scenario1-prod-diagnostic-settings}" -> null
      - target_resource_id         = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Cdn/profiles/cfdp-scenario1-prod" -> null

      - enabled_log {
          - category_group = "allLogs" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - log {
          - category_group = "allLogs" -> null
          - enabled        = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category_group = "audit" -> null
          - enabled        = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.frontdoor.azurecaf_name.caf_name_afd will be created
  + resource "azurecaf_name" "caf_name_afd" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_frontdoor"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.frontdoor.azurerm_cdn_frontdoor_firewall_policy.waf[0] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "wafpolicymicrosoftdefaultruleset21"
      + resource_group_name   = (known after apply)
      + sku_name              = "Premium_AzureFrontDoor"

      + managed_rule {
          + action  = "Block"
          + type    = "Microsoft_DefaultRuleSet"
          + version = "2.1"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_profile.frontdoor will be created
  + resource "azurerm_cdn_frontdoor_profile" "frontdoor" {
      + id                       = (known after apply)
      + name                     = (known after apply)
      + resource_group_name      = (known after apply)
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Premium_AzureFrontDoor"
      + tags                     = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "frontdoor"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_security_policy.web_app_waf[0] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "web_app_waf" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "WAF-Security-Policy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.frontdoor.azurerm_monitor_diagnostic_setting.this[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = (known after apply)
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }

  # module.key_vault.azurecaf_name.caf_name_akv will be created
  + resource "azurecaf_name" "caf_name_akv" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_key_vault"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "5461",
        ]
      + use_slug      = true
    }

  # module.key_vault.azurecaf_name.key_vault will be destroyed
  # (because azurecaf_name.key_vault is not in configuration)
  - resource "azurecaf_name" "key_vault" {
      - clean_input   = true -> null
      - id            = "hguunrloplmbyiry" -> null
      - name          = "appsvc" -> null
      - passthrough   = false -> null
      - random_length = 0 -> null
      - resource_type = "azurerm_key_vault" -> null
      - result        = "kv-appsvc-prod-5461" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - suffixes      = [
          - "prod",
          - "5461",
        ] -> null
      - use_slug      = true -> null
    }

  # module.key_vault.azurecaf_name.private_endpoint must be replaced
-/+ resource "azurecaf_name" "private_endpoint" {
      ~ id            = "brwyoneninsiueij" -> (known after apply)
      ~ name          = "kv-appsvc-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ result        = "pe-kv-appsvc-prod-5461" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_key_vault.this must be replaced
-/+ resource "azurerm_key_vault" "this" {
      ~ access_policy                   = [] -> (known after apply)
      - enabled_for_deployment          = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.KeyVault/vaults/kv-appsvc-prod-5461" -> (known after apply)
      ~ name                            = "kv-appsvc-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name             = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ tags                            = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          - "environment" = "prod" -> null
          + "module"      = "key-vault"
        }
      ~ vault_uri                       = "https://kv-appsvc-prod-5461.vault.azure.net/" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ network_acls {
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.key_vault.azurerm_private_dns_a_record.this must be replaced
-/+ resource "azurerm_private_dns_a_record" "this" {
      ~ fqdn                = "kv-appsvc-prod-5461.privatelink.vaultcore.azure.net." -> (known after apply)
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/A/kv-appsvc-prod-5461" -> (known after apply)
      ~ name                = "kv-appsvc-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ records             = [
          - "10.240.11.6",
        ] -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_private_endpoint.this must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [
          - {
              - fqdn         = "kv-appsvc-prod-5461.vault.azure.net"
              - ip_addresses = [
                  - "10.240.11.6",
                ]
            },
        ] -> (known after apply)
      ~ id                       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/privateEndpoints/pe-kv-appsvc-prod-5461" -> (known after apply)
      ~ name                     = "pe-kv-appsvc-prod-5461" # forces replacement -> (known after apply) # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/networkInterfaces/pe-kv-appsvc-prod-5461.nic.1b86c4a9-ef3f-4d4a-a496-0521921fd6c7"
              - name = "pe-kv-appsvc-prod-5461.nic.1b86c4a9-ef3f-4d4a-a496-0521921fd6c7"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [] -> (known after apply)
      ~ resource_group_name      = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id                = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-private-link" # forces replacement -> (known after apply) # forces replacement
      - tags                     = {} -> null
        # (1 unchanged attribute hidden)

      ~ private_service_connection {
          ~ name                           = "pe-kv-appsvc-prod-5461" # forces replacement -> (known after apply) # forces replacement
          ~ private_connection_resource_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.KeyVault/vaults/kv-appsvc-prod-5461" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.240.11.6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.key_vault.azurerm_role_assignment.secrets_officer[0] must be replaced
-/+ resource "azurerm_role_assignment" "secrets_officer" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.KeyVault/vaults/kv-appsvc-prod-5461/providers/Microsoft.Authorization/roleAssignments/d9ef4ea5-dfb9-5be5-6fb9-4446ee840b1e" -> (known after apply)
      ~ name                             = "d9ef4ea5-dfb9-5be5-6fb9-4446ee840b1e" -> (known after apply)
      ~ principal_id                     = "e0423675-ddf8-4a7d-82f0-74bf3e39617f" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      ~ scope                            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.KeyVault/vaults/kv-appsvc-prod-5461" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.key_vault.azurerm_role_assignment.secrets_user[0] must be replaced
-/+ resource "azurerm_role_assignment" "secrets_user" {
      ~ id                               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.KeyVault/vaults/kv-appsvc-prod-5461/providers/Microsoft.Authorization/roleAssignments/0d93282f-6fdc-9e45-ff24-2cbe16e37edb" -> (known after apply)
      ~ name                             = "0d93282f-6fdc-9e45-ff24-2cbe16e37edb" -> (known after apply)
      ~ principal_id                     = "59ae8e61-8c55-4668-81c8-029d34ac759f" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.KeyVault/vaults/kv-appsvc-prod-5461" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.network.azurecaf_name.caf_name_vnet will be created
  + resource "azurecaf_name" "caf_name_vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "eslz1"
      + passthrough   = false
      + prefixes      = [
          + "sec-baseline-1-spoke",
          + "westus3",
        ]
      + random_length = 0
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.network.azurerm_subnet.this[0] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-appsvc" -> (known after apply)
      ~ name                                           = "snet-appsvc" -> "serverFarm" # forces replacement
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "vnet-spoke-scenario1-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.network.azurerm_subnet.this[1] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-ingress" -> (known after apply)
      ~ name                                           = "snet-ingress" -> "ingress" # forces replacement
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "vnet-spoke-scenario1-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_subnet.this[2] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-devops" -> (known after apply)
      ~ name                                           = "snet-devops" -> "devops" # forces replacement
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "vnet-spoke-scenario1-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_subnet.this[3] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-private-link" -> (known after apply)
      ~ name                                           = "snet-private-link" -> "privateLink" # forces replacement
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "vnet-spoke-scenario1-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_virtual_network.this must be replaced
-/+ resource "azurerm_virtual_network" "this" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "edeb3250-0d87-4fed-b91a-ce2cbbeec192" -> (known after apply)
      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod" -> (known after apply)
      ~ name                    = "vnet-spoke-scenario1-prod" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name     = "rg-spoke-scenario1-prod-wus3" # forces replacement -> (known after apply) # forces replacement
      ~ subnet                  = [
          - {
              - address_prefix = "10.240.0.0/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-appsvc"
              - name           = "snet-appsvc"
              - security_group = ""
            },
          - {
              - address_prefix = "10.240.0.64/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-ingress"
              - name           = "snet-ingress"
              - security_group = ""
            },
          - {
              - address_prefix = "10.240.10.128/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-devops"
              - name           = "snet-devops"
              - security_group = ""
            },
          - {
              - address_prefix = "10.240.11.0/24"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-spoke-scenario1-prod-wus3/providers/Microsoft.Network/virtualNetworks/vnet-spoke-scenario1-prod/subnets/snet-private-link"
              - name           = "snet-private-link"
              - security_group = ""
            },
        ] -> (known after apply)
      ~ tags                    = {
          + "Environment" = "prod"
          + "Owner"       = "cloudops@contoso.com"
          + "Project"     = "[Scenario 1: SPOKE] App Service Landing Zone Accelerator"
          + "Terraform"   = "true"
          + "module"      = "network"
        }
        # (2 unchanged attributes hidden)
    }

  # module.network.azurerm_virtual_network_peering.target_to_this[0] will be created
  + resource "azurerm_virtual_network_peering" "target_to_this" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub-to-spoke-eslz1"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rg-hub-scenario1-wus3"
      + use_remote_gateways          = false
      + virtual_network_name         = "vnet-hub-scenario1-wus3"
    }

  # module.network.azurerm_virtual_network_peering.this_to_target[0] will be created
  + resource "azurerm_virtual_network_peering" "this_to_target" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "spoke-to-hub-eslz1"
      + remote_virtual_network_id    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/virtualNetworks/vnet-hub-scenario1-wus3"
      + resource_group_name          = (known after apply)
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

  # module.private_dns_zones.azurerm_private_dns_zone.this will be destroyed
  # (because module.private_dns_zones is not in configuration)
  # (moved from module.private_dns_zones.azurerm_private_dns_zone.this[0])
  - resource "azurerm_private_dns_zone" "this" {
      - id                                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.azurewebsites.net" -> null
      - number_of_record_sets                                 = 5 -> null
      - resource_group_name                                   = "rg-hub-scenario1-wus3" -> null
      - tags                                                  = {} -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.azurewebsites.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.private_dns_zones.azurerm_private_dns_zone.this[1] will be destroyed
  # (because module.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "this" {
      - id                                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.database.windows.net" -> null
      - number_of_record_sets                                 = 2 -> null
      - resource_group_name                                   = "rg-hub-scenario1-wus3" -> null
      - tags                                                  = {} -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.database.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.private_dns_zones.azurerm_private_dns_zone.this[2] will be destroyed
  # (because module.private_dns_zones is not in configuration)
  - resource "azurerm_private_dns_zone" "this" {
      - id                                                    = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-hub-scenario1-wus3/providers/Microsoft.Network/privateDnsZones/privatelink.azconfig.io" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.azconfig.io" -> null
      - number_of_record_sets                                 = 2 -> null
      - resource_group_name                                   = "rg-hub-scenario1-wus3" -> null
      - tags                                                  = {} -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.azconfig.io." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_ ...
```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/Azure/appservice-landing-zone-accelerator/actions/runs/5707809096">Actions</a>.<br /><br />

*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `scenarios/secure-baseline-multitenant/terraform/spoke`, Workflow: `Scenario 1: Terraform SPOKE Multi-tenant Secure Baseline`*